In [1]:
import pandas as pd

In [4]:
data = { 'name': ['John', 'Anna', 'Peter', 'Linda'],
         'location': ['New York', 'Paris', 'Berlin', 'London'],}
data

{'name': ['John', 'Anna', 'Peter', 'Linda'],
 'location': ['New York', 'Paris', 'Berlin', 'London']}

In [6]:
df = pd.DataFrame(data)
df

    name  location
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London